{
  "title": {
    "text": {
      "headline": "The Life of His Eminence Tenzin Namdak Rinpoche: A Timeline",
      "text": "Welcome. This timeline offers a journey through the extraordinary life, teachings, and accomplishments of one of the greatest masters of the Yungdrung Bön tradition. Scroll to explore key events, from his early years in Tibet to the founding of important institutions and the transmission of precious teachings across the world."
    }
  },
  "events": [
    {
      "start_date": {
        "year": 1926
      },
      "text": {
        "headline": "Birth",
        "text": "His Eminence Yongdzin Tenzin Namdak Rinpoche was born in 1926 in Khanyin village, located in the Khyungpo region of Kham, eastern Tibet."
      }
    },
    {
      "start_date": {
        "year": 1932
      },
      "text": {
        "headline": "Moves to Tengchen Monastery",
        "text": "Rinpoche went to Tengchen Monastery, where he was under the care of his uncle."
      }
    },
    {
      "start_date": {
        "year": "1936"
      },
      "text": {
        "headline": "Tangka painting apprentice ",
        "text": "Started mural painting in his homeland in Tengchen"
      }
    },
    {
      "start_date": {
        "year": "1940"
      },
      "text": {
        "headline": "Mural painting ",
        "text": "Between 1940 and 1942, at the age of around fourteen, Rinpoche journeyed with a maternal uncle to Yungdrung Ling Monastery—one of the great centres of Bön in central Tibet. Initially joining as an assistant in a mural-painting project, he soon came under the guidance of senior lamas."
      }
    },
    {
      "start_date": {
        "year": 1942
      },
      "text": {
        "headline": "Became an ordained monk (Tenzin Namdak)",
        "text": "As a youth with a clear calling, Rinpoche sought the finest teachers and training within the Bön tradition. In 1943, at the age of 17, he undertook a two-day trek to Menri Monastery in Tsang, central Tibet – the premier monastery of the Bön tradition to formally become a monk. There, he received monastic vows from Gyaltsab Tsakpé Gelong and Sonam Rinchen, taking the ordination name Tenzin Namdak, meaning “Guardian of the Essence of the Pure Doctrine of Buddha."
      }
    },
    {
      "start_date": {
        "year": "1942"
      },
      "text": {
        "headline": "Moves to Tengchen Monastery",
        "text": "Nepal and Mount Kailash"
      }
    },
    {
      "start_date": {
        "year": "1943"
      },
      "text": {
        "headline": "Returns from pilgramage to Yungdrung Ling monastery ",
        "text": "Studying in Yungdrung Ling monastery"
      }
    },
    {
      "start_date": {
        "year": "1944"
      },
      "text": {
        "headline": "Living and studying in the cave with yongdzin tshultrim Gyaltshen",
        "text": "Between 1944 and 1948, he apprenticed under his root teacher, Gangru Tsültrim Gyaltsen Rinpoche, a retired lopön (head teacher) of Yungdrung Ling. Together, they retreated to a remote cave by Juru Tso Lake in northern Tibet, where Yongdzin Rinpoche undertook intensive training. In this secluded hermitage, he studied a broad range of subjects—from grammar and poetry to cosmology and the stages of the path—as well as the advanced meditation teachings of Sutra, Tantra, and Dzogchen."
      }
    },
    {
      "start_date": {
        "year": "1948"
      },
      "text": {
        "headline": "Returs to Menri monastery ",
        "text": "In late 1948, following his first teacher’s advice, Yongdzin Rinpoche returned to Menri Monastery to complete the rigorous scholastic programme for the Geshe degree (equivalent to a doctorate in philosophy). His principal mentor at Menri was Lopön Sangye Tenzin Rinpoche, one of Bön’s greatest scholars of the era."
      }
    },
    {
      "start_date": {
        "year": 1952
      },
      "text": {
        "headline": "Received Geshe Degree",
        "text": "Awarded the highest monastic degree at Menri"
      }
    },
    {
      "start_date": {
        "year": "1952"
      },
      "text": {
        "headline": "Appointed Lopön of Menri",
        "text": "Appointed head teacher of Bön's premier monastery and became responsible for Mentri monastery in Tibet"
      }
    },
    {
      "start_date": {
        "year": 1955
      },
      "text": {
        "headline": "Disciple Becomes 32nd Abbot of Menri",
        "text": "Had a divinatory appointment ritual for the appointment of the Menri abbot"
      }
    },
    {
      "start_date": {
        "year": "1957"
      },
      "text": {
        "headline": "Spiritual Retreat at Dangra Lake",
        "text": "Retreating in Sezhing monastery on the Dangra lake in northern Tibet"
      }
    },
    {
      "start_date": {
        "year": "1961"
      },
      "text": {
        "headline": "Captured and Escapes Tibet",
        "text": "Captured, imprisoned, escaped to Nepal"
      }
    },
    {
      "start_date": {
        "year": 1961
      },
      "text": {
        "headline": "Arrives in the UK on Rockefeller Grant",
        "text": "Invited by David Snellgrove to SOAS, London. Supported by the Rockefeller Foundation for research"
      }
    },
    {
      "start_date": {
        "year": 1964
      },
      "text": {
        "headline": "Returns to India",
        "text": "Rejoined the exile Bön community"
      }
    },
    {
      "start_date": {
        "year": 1966
      },
      "text": {
        "headline": "Founds Tibetan Bönpo Foundation in India",
        "text": "Registered the Foundation in the indian state of Uttar Pradesh"
      }
    },
    {
      "start_date": {
        "year": 1967
      },
      "text": {
        "headline": "Establishes Dolanji Tibetan Refugee Settlement",
        "text": "Establishing the Dolanji Tibetan Refugee settlement in India"
      }
    },
    {
      "start_date": {
        "year": 1967
      },
      "text": {
        "headline": "Publishes *The Nine Ways of Bön*",
        "text": "Co-authored the first major Western academic study on Bön"
      }
    },
    {
      "start_date": {
        "year": 1968
      },
      "text": {
        "headline": "Initiates Menri Monastery in Exile",
        "text": "Electing the 33rd abbot, Menri Trinzin"
      }
    },
    {
      "start_date": {
        "year": 1968
      },
      "text": {
        "headline": "Facilitates Election of 33rd Abbot of Menri",
        "text": "Facilitated the election of the 33rd abbot of Menri after the death of the previous abbot while Rinpoche was in London, Geshe Sangye Tenzin became the 33rd abbot, who was then welcomed back from Oslo to India in November 1969. was the name of Lungtok Tenpai Nyima, \n"
      }
    },
    {
      "start_date": {
        "year": 1969
      },
      "text": {
        "headline": "Visiting Scholar at University of Munich",
        "text": "Collaborated on Tibetan-English dictionary"
      }
    },
    {
      "start_date": {
        "year": "1969"
      },
      "text": {
        "headline": "Rebuilds Menri Monastic Life in Exile",
        "text": "Full engagement with monastic life in Menri India, printing Bön texts, reconstruction of Menri Monastery in India, engaged in teaching, practising and writing"
      }
    },
    {
      "start_date": {
        "year": 1978
      },
      "text": {
        "headline": "Establishes Dialectic School at Menri",
        "text": "The same year, bestowing initiation and teaching of the Gyubuchung Cunyi (twelve little tantras) to Choegyal Namkhai Norbu Rinpoche and his students who visited Menri monastery and the Bon settlement for teachings"
      }
    },
    {
      "start_date": {
        "year": "1978"
      },
      "text": {
        "headline": "Devotes Time to Teaching and Writing",
        "text": "Teaching full time in the dialectic school of Dolanji Menri Monastery"
      }
    },
    {
      "start_date": {
        "year": 1984
      },
      "text": {
        "headline": "Confers First Secret Empowerments",
        "text": "Bestowing his first inner, outer, and secret empowerments of Yungdrung Bon to the lay and ordained devotees of Bön, including the 33rd abbot of Menri monastery"
      }
    },
    {
      "start_date": {
        "year": 1986
      },
      "text": {
        "headline": "Bestows First Geshe Degree at Menri",
        "text": ""
      }
    },
    {
      "start_date": {
        "year": 1986
      },
      "text": {
        "headline": "Returns to Tibet to Bestow Teachings and Transmissions ",
        "text": "Returning to Tibet for the first time since exhile bestowing teaching and transmission to devotees of Bön, visirting several Bön monasteries in Shingatse, Qamdo, Nagqu, Stengchen, Kongpo, Zingchu, Amdo Ngaba, ordaining monks, performing rituals, and transmission, and performing the dialectic school in menri monastery Tibet, presiding over the inauguration ceremony of a new dielctic school in Ri Tsedrug monastery, appointing the abbot of Dingchen monastery, his diciples went under process of oral examination as if they were taking the geshe exam in front of the congretion of monks led by the head teacher Kinzang Lodro in Yungdrung Ling monastery"
      }
    },
    {
      "start_date": {
        "year": 1987
      },
      "text": {
        "headline": "Founds Triten Norbutse Monastery",
        "text": "Established the only major Bön monastery in Kathmandu, Nepal."
      }
    },
    {
      "start_date": {
        "year": "1987"
      },
      "text": {
        "headline": "Continues Teaching at Menri in India",
        "text": "Teaching at Menri while supervising the construction of Triten Norbutse in Nepal"
      }
    },
    {
      "start_date": {
        "year": 1989
      },
      "text": {
        "headline": "Begins First Western Teaching Tour",
        "text": "Taught Dzogchen in the UK, USA, Italy at the invitation of Namkhai Norbu"
      }
    },
    {
      "start_date": {
        "year": "1989"
      },
      "text": {
        "headline": "Teaches Dzogchen Across the West",
        "text": "France, UK, Germany, Switzerland, Austria, USA, Mexico, Holland, Argentina, Thailand"
      }
    },
    {
      "start_date": {
        "year": 1991
      },
      "text": {
        "headline": "Attends Kalachakra with H.H. Dalai Lama invitation",
        "text": ""
      }
    },
    {
      "start_date": {
        "year": 1992
      },
      "text": {
        "headline": "Second Return to Tibet for Teachings",
        "text": "Meeting with heirs of Shen lineage, Norbu Wangyal, visiting several Bon monasteries in Nagqu, Qamdo, Teng-chen, bestowing local monks initiation, transmission, teaching, and ordinating monks, consecrating and performing and teaching rituals"
      }
    },
    {
      "start_date": {
        "year": 1994
      },
      "text": {
        "headline": "Third Visit to Tibet and Rituals in Lhasa",
        "text": "Meeting Shen Norbu Wangyal and his sons in Lhasa, meeting with the 33rd abbot in Lhasa and performing rituals together with him for devotees"
      }
    },
    {
      "start_date": {
        "year": 1994
      },
      "text": {
        "headline": "Inaugurates New Temple at Triten Norbutse",
        "text": "Establishing the dialecting and meditation school at Triten Norbutse"
      }
    },
    {
      "start_date": {
        "year": 1996
      },
      "text": {
        "headline": "Appoints Triten Norbutse Council",
        "text": "Drafting the structure and function of the Triten Norbutse"
      }
    },
    {
      "start_date": {
        "year": 1997
      },
      "text": {
        "headline": "Leads Bön Mandala Project in Osaka ",
        "text": "Cooperation with the National Museum of Ethnology in Osaka, supervising the painting of 130 mandalas from the relevant text of the Bön religion, which were exhibited and collected in the museum, giving instructions for the writing and publishing of the Bon Mandalas"
      }
    },
    {
      "start_date": {
        "year": 1999
      },
      "text": {
        "headline": "Fourth Return to Tibet for Teaching and Ordinations",
        "text": "Meeting Shen Norbu Wangyal and a number of monasteries in Teng-chen and Ba chen consecrating, initiating and giving transmissions in these monasteries, inaugurating the dialectic school in Teng-chen monastery, sponsoring and initiating the Tibetan medical school in Teng-chen county"
      }
    },
    {
      "start_date": {
        "year": 2001
      },
      "text": {
        "headline": "Bestowing First Geshe Degree at Triten Norbutse",
        "text": "Bestowing First Geshe Degree at Triten NorbutseTriten Norbutse Monastery"
      }
    },
    {
      "start_date": {
        "year": 2001
      },
      "text": {
        "headline": "Electing the abbot of Triten Norbutse",
        "text": "Appointed his disciple Jeru Geshe Tenpa Yungdrung as the abbot of Triten Norbutse Monastery"
      }
    },
    {
      "start_date": {
        "year": 2001
      },
      "text": {
        "headline": "Bestows Series of Secret Empowerments ",
        "text": "Bestows Series of Secret Empowerments to lay and monastic community at Triten Norbutse monastery"
      }
    },
    {
      "start_date": {
        "year": 2005
      },
      "text": {
        "headline": "Founds Shenten Dargye Ling Retreat Centre",
        "text": "Established French retreat centre; Bön recognised in France"
      }
    },
    {
      "start_date": {
        "year": 2005
      },
      "text": {
        "headline": "Publishes 13-Volume Collected Works",
        "text": "Publication in India"
      }
    },
    {
      "start_date": {
        "year": 2006
      },
      "text": {
        "headline": "French Government Recognises Shenten Dargye Ling",
        "text": "By the Ministry of the Interior of the French government"
      }
    },
    {
      "start_date": {
        "year": 2006
      },
      "text": {
        "headline": "Relocates Tibetan Medical School to Triten Norbutse",
        "text": "Relocating the Tibet Medical School from Dhorpatan to Triten Norbutse"
      }
    },
    {
      "start_date": {
        "year": 2007
      },
      "text": {
        "headline": "Final Return to Tibet and Ordains 150 Monks",
        "text": "Meeting Shen Norbu Wangyal, Gyalse yungrung Gyalwa, giving teachings and transmissions of the primary practice to the family members of Shen and meeting devotees from various parts of Tibet, ordaining more than 150 monks, identifying and visiting Bon sacred sites"
      }
    },
    {
      "start_date": {
        "year": 2007
      },
      "text": {
        "headline": "Visits Zhu Rizhing and Blesses New Sites",
        "text": "Visiting Zhu Rizhing Yungdrung Kundragling, inaugurating the meditation school there and visiting the newly purchased site for the future school of Sheing Phunthogling Bon Society in India, blessing and consecrating the site where the Tise Himalayan International School by Triten Norbutse would be located"
      }
    },
    {
      "start_date": {
        "year": 2009
      },
      "text": {
        "headline": "Oversees Stupa Construction at Shenten",
        "text": "Presiding over the stupa construction of the Yungdrung Loeg stupa"
      }
    },
    {
      "start_date": {
        "year": 2010
      },
      "text": {
        "headline": "Sends Relics Back to Menri in Tibet",
        "text": "Sending back two important images to the Menri monastery in Tibet"
      }
    },
    {
      "start_date": {
        "year": "2010"
      },
      "text": {
        "headline": "Completes Dzogchen Transmission to Western Lay Practitioners",
        "text": "Bestowing transmission and teachings of Zhang Zhung Nyengund Kagyud Korzhi completely to lay practitioners of the summer retreat of Shenten"
      }
    },
    {
      "start_date": {
        "year": 2017
      },
      "text": {
        "headline": "Guides 34th Abbot Election at Menri",
        "text": "Provides instructions for the 34th election of the Menri abbot"
      }
    },
    {
      "start_date": {
        "year": 2018
      },
      "text": {
        "headline": "Blesses 34th Abbot and Supports School Opening",
        "text": "Supporting the opening of the Tise Himalayan school, presiding over the Dutrisu ceremony in the autumn retreat of Shenten"
      }
    },
    {
      "start_date": {
        "year": 2019
      },
      "text": {
        "headline": "Begins Construction of New Temple at Triten Norbutse",
        "text": ""
      }
    },
    {
      "start_date": {
        "year": 2020
      },
      "text": {
        "headline": "Celebrates 95th Birthday with Devotees",
        "text": "Joined by housands of devotees from various countries of the East and West"
      }
    },
    {
      "start_date": {
        "year": 2021
      },
      "text": {
        "headline": "Publishes Complete 22-Volume Collected Works ",
        "text": "Publishing the full 22. volume of his works and the second edition of the 13 volumes of the previous works"
      }
    },
    {
      "start_date": {
        "year": 2024
      },
      "text": {
        "headline": "Moves into New Residence at Completed Temple",
        "text": ""
      }
    },
    {
      "start_date": {
        "year": 2025
      },
      "text": {
        "headline": "Inaugurates New Temple During Centennial",
        "text": "During the 100th year ceremony"
      }
    },
    {
      "start_date": {
        "year": 2025
      },
      "text": {
        "headline": "100th Birthday Celebration",
        "text": "Centennial celebrated with 6000 devotees"
      }
    },
    {
      "start_date": {
        "year": "2025"
      },
      "text": {
        "headline": "Enters Thukdam and Parinirvana",
        "text": "Passed away peacefully on June 12 during Saga Dawa"
      }
    }
  ]
}
