{
  "title": {
    "text": {
      "headline": "The Life of Yongdzin Lopön Rinpoche: A Timeline",
      "text": "This interactive timeline, designed and created by Shima Beigi, invites you on a journey through the extraordinary life, teachings, and accomplishments of one of the greatest masters of the Yungdrung Bön tradition. As you scroll, explore the pivotal moments—from his early years in Tibet to the founding of renowned institutions and the global transmission of his precious wisdom. The information presented here has been generously provided by Khenchen Rinpoche, and the final version of this public timeline has been reviewed and verified by him."
    }
  },
  "events": [
    {
      "start_date": {
        "year": 1926
      },
      "text": {
        "headline": "Birth",
        "text": "His Eminence Yongdzin Tenzin Namdak Rinpoche was born in 1926 in Khanyin village, located in the Khyungpo region of Kham, eastern Tibet."
      }
    },
    {
      "start_date": {
        "year": 1932
      },
      "text": {
        "headline": "Moves to Tengchen Monastery",
        "text": "He was raised in a family steeped in Bönpo heritage—his paternal uncle, the respected umzé (chant leader) Drewo Umzé, taught him to read, write, and chant sacred liturgies, while his maternal grandfather introduced him to the sacred art of thangka painting. Immersed in this rich cultural and spiritual environment, the young Tenzin Namdak developed a profound affinity for Yungdrung Bön, Tibet’s indigenous spiritual tradition. At the age of seven, he entered Tengchen Monastery, where his uncle served as chant master. There, he became deeply engaged in the rhythm of monastic life, learning basic liturgy and rituals and observing firsthand the disciplined, contemplative existence of the monks."
      }
    },
    {
      "start_date": {
        "year": "1936"
      },
      "text": {
        "headline": "Tangka painting apprentice ",
        "text": "Started mural painting in his homeland in Tengchen"
      }
    },
    {
      "start_date": {
        "year": "1940"
      },
      "text": {
        "headline": "Mural painting ",
        "text": "Between 1940 and 1942, at the age of around fourteen, Rinpoche journeyed with a maternal uncle to Yungdrung Ling Monastery—one of the great centres of Bön in central Tibet. Initially joining as an assistant in a mural-painting project, he soon came under the guidance of senior lamas."
      }
    },
    {
      "start_date": {
        "year": 1942
      },
      "text": {
        "headline": "Became an ordained monk (Tenzin Namdak)",
        "text": "As a youth with a clear calling, Rinpoche sought the finest teachers and training within the Bön tradition. In 1943, at the age of 17, he undertook a two-day trek to Menri Monastery in Tsang, central Tibet – the premier monastery of the Bön tradition to formally become a monk. There, he received monastic vows from Gyaltsab Tsakpé Gelong and Sonam Rinchen, taking the ordination name Tenzin Namdak, meaning “Guardian of the Essence of the Pure Doctrine of Buddha."
      }
    },
    {
      "start_date": {
        "year": "1942"
      },
      "text": {
        "headline": "Moves to Tengchen Monastery",
        "text": "Nepal and Mount Kailash"
      }
    },
    {
      "start_date": {
        "year": "1943"
      },
      "text": {
        "headline": "Returns from pilgramage to Yungdrung Ling monastery ",
        "text": "Studying in Yungdrung Ling monastery"
      }
    },
    {
      "start_date": {
        "year": "1944"
      },
      "text": {
        "headline": "Living and studying in the cave with yongdzin tshultrim Gyaltshen",
        "text": "Between 1944 and 1948, he apprenticed under his root teacher, Gangru Tsültrim Gyaltsen Rinpoche, a retired lopön (head teacher) of Yungdrung Ling. Together, they retreated to a remote cave by Juru Tso Lake in northern Tibet, where Yongdzin Rinpoche undertook intensive training. In this secluded hermitage, he studied a broad range of subjects—from grammar and poetry to cosmology and the stages of the path—as well as the advanced meditation teachings of Sutra, Tantra, and Dzogchen."
      }
    },
    {
      "start_date": {
        "year": "1948"
      },
      "text": {
        "headline": "Returs to Menri monastery ",
        "text": "In late 1948, following his first teacher’s advice, Yongdzin Rinpoche returned to Menri Monastery to complete the rigorous scholastic programme for the Geshe degree (equivalent to a doctorate in philosophy). His principal mentor at Menri was Lopön Sangye Tenzin Rinpoche, one of Bön’s greatest scholars of the era."
      }
    },
    {
      "start_date": {
        "year": 1952
      },
      "text": {
        "headline": "Received Geshe Degree",
        "text": "In late 1948, following his first teacher’s advice, Tenzin Namdak returned to Menri Monastery to complete the rigorous scholastic programme for the Geshe degree (equivalent to a doctorate in philosophy). His principal mentor at Menri was Lopön Sangye Tenzin Rinpoche, one of Bön’s greatest scholars of the era. An exceptional student, he mastered the Nine Ways of Bön (the complete spectrum of Bön teachings), Bön logic (tshad-ma), epistemology, the Prajnaparamita (pharchin), Madhyamaka philosophy, monastic discipline, cosmology (dzö), as well as the intricate Mother Tantra (Ma Gyud) and the four major cycles of Dzogchen practice. He became a Geshe in 1952 at the age of 27, graduating with top honours."
      }
    },
    {
      "start_date": {
        "year": "1952"
      },
      "text": {
        "headline": "Appointed Lopön of Menri",
        "text": "That same year, recognising his profound erudition and insight, the monastery elected him to succeed his teacher as the Lopön (head teaching master) of Menri. Thus, by his mid-twenties, Tenzin Namdak Rinpoche had ascended to one of the highest scholarly and teaching positions in the Bön tradition. More importantly, he had received and safeguarded Bön’s most vital lineages. His teacher, Sangye Tenzin, conferred upon him the single living transmission of the entire Zhang Zhung Nyengyü Dzogchen cycle, making him the sole lineage holder of that profound oral tradition."
      }
    },
    {
      "start_date": {
        "year": 1955
      },
      "text": {
        "headline": "Disciple Becomes 32nd Abbot of Menri",
        "text": "Had a divinatory appointment ritual for the appointment of the Menri abbot"
      }
    },
    {
      "start_date": {
        "year": "1957"
      },
      "text": {
        "headline": "Spiritual Retreat at Dangra Lake",
        "text": "Rinpoche entered into a remote retreat at Sezhig Monastery near the sacred Lake Dangra in the northern region. There, he remained in meditation from 1958 to 1960."
      }
    },
    {
      "start_date": {
        "year": "1961"
      },
      "text": {
        "headline": "Captured and Escapes Tibet",
        "text": "Rinpoche encountered significant challenges in his work and practice in Tibet due to the political upheavals of the 1950s. This tumultuous period brought increasing pressure on monastic institutions. In response to these conditions, Rinpoche was among those who sought refuge outside of Tibet. In 1960, he, along with a small group, embarked on a perilous journey toward the border, aiming for the safety of Nepal or India. Tragically, this endeavour was fraught with danger, as he was shot and subsequently captured, leading to a period of imprisonment that lasted approximately ten months."
      }
    },
    {
      "start_date": {
        "year": 1961
      },
      "text": {
        "headline": "Arrives in the UK on Rockefeller Grant",
        "text": "Yongdzin Rinpoche played a pivotal role in both the revival of Bön within the Tibetan exile community and in introducing its teachings to the Western world. His engagement with the West began in the early 1960s, shortly after he settled in India. In 1961, he received an invitation from the esteemed Tibetanologist Professor David Snellgrove at the School of Oriental and African Studies (SOAS) in London. With the support of a Rockefeller Foundation grant, Rinpoche travelled to England, where he served as a visiting scholar at both SOAS and the University of Cambridge."
      }
    },
    {
      "start_date": {
        "year": 1964
      },
      "text": {
        "headline": "Returns to India",
        "text": "Exile brought significant challenges for Bönpo refugees, who faced marginalisation. Resources were extremely limited, making it a daily struggle to provide food for the monks and new arrivals. In 1964, Rinpoche returned to India, maintaining strong connections with Western scholars. Upon rejoining the Bön community in exile, he had to take on responsibilities that extended beyond those of a typical lama. Out of sheer necessity, he stepped into the roles of community organiser, fundraiser, and construction supervisor."
      }
    },
    {
      "start_date": {
        "year": 1966
      },
      "text": {
        "headline": "Founds Tibetan Bönpo Foundation in India",
        "text": "After returning to India and joining the Tibetan refugees, Rinpoche settled in Himachal Pradesh, a northern Indian state, and immediately undertook the significant task of rebuilding the Bön community in exile. By the early 1960s, Bönpo lamas and monks were scattered and living in dire conditions, with no organised support. Rinpoche and a small group of Bönpo refugees recognised that without immediate action, their ancient tradition could easily disappear. From 1964 onwards, he worked tirelessly to establish a permanent base for Bön in exile. In 1966, under his leadership, the Tibetan Bönpo Foundation was formally registered with the Indian government in the indian state of Uttar Pradesh."
      }
    },
    {
      "start_date": {
        "year": 1967
      },
      "text": {
        "headline": "Establishes Dolanji Tibetan Refugee Settlement",
        "text": "Following the establishment of the Tibetan Bönpo Foundation, Yongdzin Rinpoche began constructing a refugee settlement, school, and temple. By 1967, about seventy to eighty Bönpo families had been relocated from makeshift camps (such as those in Manali) to the new Dolanji settlement. Rinpoche personally oversaw every aspect of developing this fledgling community. Under makeshift conditions – often with limited resources and only a few surviving monks – he helped re-establish Menri Monastery in exile at the Dolanji site."
      }
    },
    {
      "start_date": {
        "year": 1967
      },
      "text": {
        "headline": "Publishes *The Nine Ways of Bön*",
        "text": "In 1961, Yongdzin Rinpoche travelled to Britain to participate in academic and cultural exchanges. Over the following three years, from 1961 to 1964, he immersed himself in studying English—an entirely new language to him at the time—reaching a level that enabled him to teach Tibetan to Western students and share the foundational principles of the Bön tradition. During this period, he formed a significant collaboration with Professor David Snellgrove, laying the groundwork for what would become a landmark scholarly work. In 1967, their joint effort culminated in the publication of *The Nine Ways of Bön* by Oxford University Press. This pioneering book presented translations and detailed explanations of essential Bön texts, including selections from the Ziji, the biography of Buddha Tonpa Shenrab. Widely recognised as the first serious academic study of Yungdrung Bön in the West, the publication dispelled the long-held belief that Buddhism was Tibet’s only spiritual tradition. It ignited international interest in Bön studies and contributed to establishing Bön as a legitimate academic field. Throughout this process, Rinpoche played a vital dual role—not only as a cultural informant but also as a dedicated scholar, ensuring the accuracy and authenticity of the translations. This East–West collaboration marked a turning point in raising global awareness of the ancient Bön tradition."
      }
    },
    {
      "start_date": {
        "year": 1968
      },
      "text": {
        "headline": "Initiates Menri Monastery in Exile",
        "text": "With the establishment of the Tibetan Bönpo Foundation and the Dolanji settlement came a profound commitment from Yongdzin Rinpoche to the refugee community. Operating under dire conditions—with only a few surviving monks and scarce resources—Rinpoche led the revival of Menri Monastery in exile at the Dolanji site, revitalising monastic education and ritual practice at the heart of the Bön tradition. Thanks to Rinpoche's relentless organisational leadership and vision, Menri Monastery at Dolanji became not only the spiritual and educational centre of the exile Bön tradition but also one of only two centres in the world—alongside Triten Norbutse in Nepal—offering full Geshe training in Yungdrung Bön."
      }
    },
    {
      "start_date": {
        "year": 1968
      },
      "text": {
        "headline": "Facilitates Election of 33rd Abbot of Menri",
        "text": "In 1968, at the newly established Dolanji settlement, Geshe Sangye Tenzin Yongdzin was chosen as the 33rd Menri Trizin—the abbot of Menri Monastery in exile—after a week-long ritual conducted by senior Bön teachers and lamas. The divination and prayers performed in India officially initiated the lineage in exile and marked the formal inauguration of Menri Monastery in Exile. While still in London, Rinpoche played a vital role in organising the traditional election of a new abbot for the exile monastery following the death of the previous one, thereby re-establishing the spiritual leadership of the Bön tradition in exile. Geshe Sangye Tenzin, although abroad at the time, was welcomed back to India from Oslo in November 1969 and was given the name Lungtok Tenpai Nyima. His enthronement officially renewed the spiritual leadership of the exile Bön community."
     }
    },
    {
      "start_date": {
        "year": 1969
      },
      "text": {
        "headline": "Visiting Scholar at University of Munich",
        "text": "Rinpoche made a second trip to Europe at the invitation of Professor Helmut Hoffmann in Munich, Germany. There, he served as a visiting scholar at Ludwig Maximilian University, collaborating with Hoffmann on compiling a comprehensive Tibetan-English dictionary. This dictionary project (Wörterbuch der tibetischen Schriftsprache) would continue for decades, with Rinpoche contributing his extensive knowledge of classical Tibetan terminology, including Bön technical terms. Through these academic engagements, he helped make Tibetan literature (both Bön and Buddhist) more accessible to Western researchers."
      }
    },
    {
      "start_date": {
        "year": "1969"
      },
      "text": {
        "headline": "Rebuilds Menri Monastic Life in Exile",
        "text": "With a new abbot in place to serve as the spiritual head, Rinpoche could concentrate on education and training. He devoted himself to teaching the younger generation of monks and restoring the complete monastic curriculum that had been lost. During the late 1960s and 1970s, he scoured the Tibetan diaspora and the Himalayan regions for Bön texts and oral knowledge. He coordinated efforts to recover Bön manuscripts from remote areas of Nepal and Tibet, where Bön had been practised for centuries. These manuscripts – some of which were the very texts he had hidden or carried away – were brought to India, carefully reprinted in Delhi, and distributed to the newly re-established Bön study centres as well as Western universities."
      }
    },
    {
      "start_date": {
        "year": 1978
      },
      "text": {
        "headline": "Establishes Dialectic School at Menri",
        "text": "In 1978, under the guidance of Yongdzin Rinpoche, the Yungdrung Bön Shedrup Lobnyer Dudé college was officially established, reviving the rigorous nine-year Geshe curriculum for the first time in exile. He served as one of its earliest professors, educating a new generation of learned monks. The same year, he bestowed initiation and teachings of the Gyubuchung Cunyi (twelve small tantras) to Choegyal Namkhai Norbu Rinpoche and his students during their visit to Menri Monastery and the Bön settlement for teachings."
      }
    },
    {
      "start_date": {
        "year": "1978"
      },
      "text": {
        "headline": "Devotes Time to Teaching and Writing",
        "text": "Through his extraordinary efforts in India, Yongdzin Rinpoche laid the essential foundation for the survival of the Yungdrung Bön tradition. In just two decades, he and a small group of dedicated monks and devotees achieved something truly remarkable: they transformed a fragile community on the brink of extinction into a thriving monastic centre—complete with a functioning abbacy, a growing monastic sangha, a library of sacred texts, and a comprehensive educational system.\n\nThis period required immense faith, tireless effort, and profound organisational skill on Rinpoche’s part. While continuing to teach full-time at the dialectic school of Menri Monastery in Dolanji, he also dedicated himself to research, writing, and the transmission of initiations and instructions to a new generation of Bön lamas.\n\nThe culmination of this intense phase of engagement and contemplation resulted in the compilation of over 22 authoritative volumes, covering a vast range of topics central to the Bön tradition, including:\n\n- The successive lives of Tonpa Shenrab, the revered founder of Bön, and an exploration of his teachings and their enduring impact on the tradition.\n- The history and doctrinal foundations of Yungdrung Bön, detailing the tradition’s development and spiritual significance within the broader landscape of Tibetan religious culture.\n- Cosmology, iconography, and the sacred arts, offering insight into the deep interconnection between belief, ritual, and artistic expression in Bön culture.\n- Detailed expositions of the Nine Vehicles of Bön, presenting the diverse paths of practice available to followers, each corresponding to varying levels of understanding and spiritual capacity.\n- Instructions on meditation and ritual practices, guiding practitioners through both personal and communal spiritual journeys toward realisation and enlightenment.\n\nThrough these monumental works, Yongdzin Rinpoche ensured that the profound and subtle knowledge of the Bön tradition would not only survive but flourish, preserved in an authoritative form for future generations to study, practice, and draw inspiration from."
      }
    },
    {
      "start_date": {
        "year": 1984
      },
      "text": {
        "headline": "Confers First Series of Empowerments",
        "text": "As a transmission and initiation lineage holder, Yongdzin Rinpoche compassionately granted students, both monastic and lay, a series of initiations (wang), transmissions (lung), and personal instructions (tri). In 1984, Rinpoche conferred the inner, outer, and secret series of empowerments of Yungdrung Bön on both lay and ordained practitioners, including the 33rd abbot of Menri Monastery. This marked the start of many subsequent series of cyclical transmissions Rinpoche would initiate in the years that followed. Later, in the 1990s, Rinpoche bestowed rare tantric transmissions, including the Ma Gyud (Mother Tantra), on Western and Tibetan students."
      }
    },
    {
      "start_date": {
        "year": 1986
      },
      "text": {
        "headline": "Bestows First Geshe Degree at Menri",
        "text": "After establishing the Yungdrung Bön Shedrup Lobnyer Dudé college in Dolanji, India, and reviving the complete nine-year Geshe curriculum for Bön at Menri Monastery in exile in 1986, Rinpoche consecrated the Geshe degrees ceremony for the first group of Bön scholars to graduate with Geshe degrees. This milestone signifies the successful transplantation of the Yungdrung Bön intellectual and spiritual lineage to new ground."
      }
    },
    {
      "start_date": {
        "year": 1986
      },
      "text": {
        "headline": "Returns to Tibet to Bestow Teachings and Transmissions ",
        "text": "Rinpoche returned to Tibet for the first time since his exile from Tibet. During this visit, he shared teachings and transmissions with Bön devotees, travelling to several Bön monasteries in Shigatse, Qamdo, Nagqu, Stengchen, Kongpo, Zingchu, and Amdo Ngaba. He ordained monks, performed rituals and transmissions, and presided over the inauguration ceremony of a new dialectic school at Ri Tsedrug Monastery. Additionally, he appointed the abbot of Dingchen Monastery. His disciples underwent oral examinations, similar to the geshe exam, in front of a congregation of monks led by the head teacher, Kinzang Lodro, at Yungdrung Ling Monastery."
      }
    },
    {
      "start_date": {
        "year": 1987
      },
      "text": {
        "headline": "Founds Triten Norbutse Monastery",
        "text": "In 1987, beginning with only a handful of monks and modest facilities, Rinpoche initiated the construction of Triten Norbutse, the only major Bön monastery in Kathmandu, Nepal. Rinpoche envisioned a monastery dedicated to the study and practice of the complete Bön teachings, encompassing Sutra, Tantra, and Dzogchen. He replicated and expanded the education system that had been established in Dolanji. By 1994, the monastery had officially instituted a 13-year Geshe degree programme, offering the highest level of academic training in Bön philosophy and sciences. 
."
      }
    },
    {
      "start_date": {
        "year": "1987"
      },
      "text": {
        "headline": "Continues Teaching at Menri in India",
        "text": "Between 1987 and 1994, Rinpoche, while deeply engaged in the construction of Triten Norbutse, returned to Menri to continue fulfilling his teaching responsibilities."
      }
    },
    {
      "start_date": {
        "year": 1989
      },
      "text": {
        "headline": "Begins First Western Teaching Tour",
        "text": "1989 marked a historic moment in Rinpoche's deep devotion to the global dissemination of Yungdrung Bön. Invited by the International Dzogchen Community of Chögyal Namkhai Norbu, Yogdzin Rinpoche travelled to Italy, England, and the United States, becoming the first Bön master to publicly transmit Dzogchen teachings in the West. Drawing from the Atri and Zhang Zhung Nyengyü traditions, he introduced Western students to foundational and advanced practices such as trekchö, thögel, and calm abiding (zhiné). Rinpoche's clarity, humility, and compassionate presence left a lasting impression, establishing enduring connections and laying the foundation for future Bön centres and study communities across Europe and the Americas."
      }
    },
    {
      "start_date": {
        "year": "1989"
      },
      "text": {
        "headline": "1989–2018 – Teaches Dzogchen Across the West",
        "text": "Over nearly three decades, from 1989 to 2018, His Eminence Yongdzin Rinpoche became one of the most influential figures in bringing Bön Dzogchen teachings to the Western world. Responding to invitations from growing international sanghas, he offered teachings in the United States, Argentina, Mexico, the United Kingdom, France, Germany, the Netherlands, Poland, Italy, and Scandinavia. Rinpoche transmitted the heart essence teachings of the Zhang Zhung Nyengyü and Atri lineages to thousands of students, emphasising experiential understanding through trekchö and thögel practices. He held retreats, gave empowerments, and established enduring spiritual relationships with Western practitioners."
      }
    },
    {
      "start_date": {
        "year": 1991
      },
      "text": {
        "headline": "Attends Kalachakra at the Invitation of H.H. the Dalai Lama",
        "text": "In a landmark moment for the recognition of the Bön tradition, His Eminence Yongdzin Rinpoche was personally invited by His Holiness the 14th Dalai Lama to attend the Kalachakra initiation in New York City. Seated among the heads of the Tibetan spiritual traditions, Rinpoche represented Yungdrung Bön on the international stage. This public acknowledgement affirmed Bön's equal status alongside the four major schools of Tibetan Buddhism and symbolised a turning point in inter-traditional respect and unity. Rinpoche's dignified presence and spiritual authority further elevated global awareness of Bön as an authentic and ancient spiritual lineage."
      }
    },
    {
      "start_date": {
        "year": 1992
      },
      "text": {
        "headline": "Second Return to Tibet for Reviving Lineage and Teaching Across Bön Monasteries",
        "text": "In 1992, Yongdzin Rinpoche returned to Tibet to support the revival of the Bön tradition in its homeland. During this pivotal journey, he visited numerous historic Bön monasteries across regions, including Nagqu, Qamdo, and his childhood region of Tengchen. He met with heirs of the Shen lineage, including Norbu Wangyal, reaffirming the continuity of the ancient family lineage of Tonpa Shenrab. At each site, Rinpoche bestowed essential transmissions, including initiations (wang), oral transmissions (lung), and direct instructions (tri) to local monks and practitioners. He also performed ritual consecrations, taught sacred ceremonies, and ordained new monks, revitalising monastic life and ensuring the transmission of authentic Bön teachings. His return was received with deep reverence, reestablishing a living connection between the Tibetan homeland and the flourishing Bön tradition in exile."
      }
    },
    {
      "start_date": {
        "year": 1994
      },
      "text": {
        "headline": "Third Visit to Tibet: Rituals and Lineage Encounters in Lhasa",
        "text": "In 1994, Yongdzin Rinpoche made his third return to Tibet, with a significant focus on Lhasa. There, he reunited with Shen Norbu Wangyal, a descendant of the ancient Shen lineage, and met his sons, reaffirming ties with the hereditary line of Tonpa Shenrab. Rinpoche also met with the 33rd Abbot of Menri Monastery (in Tibet) during this visit, a historic moment of unity between the exile and homeland branches of the tradition. Together, they performed public rituals for Tibetan devotees, blessing and empowering a large number of practitioners. This visit symbolised a sacred reconnection of the Bön community and strengthened the bridges between East and West, old and new."
      }
    },
    {
      "start_date": {
        "year": 1994
      },
      "text": {
        "headline": "Inaugurates New Temple and Establishes Dialectic and Meditation Schools at Triten Norbutse",
        "text": "In 1994, His Eminence Yongdzin Rinpoche consecrated the newly constructed main temple at Triten Norbutse Monastery in Kathmandu, marking a major milestone in the monastery's development. This temple became the central sacred space for rituals, teachings, and community practice. In the same year, Rinpoche officially established both the dialectic school (shedra) and the meditation school (drubdra), creating a dual-path monastic education system. The 13-year Geshe curriculum was launched, offering in-depth training in Bön philosophy, cosmology, and logic, while the meditation school focused on advanced practices of Dzogchen, Tantra, and retreat. This comprehensive model ensured that Triten Norbutse would produce both scholars and realised practitioners, securing the future of the Yungdrung Bön lineage for generations to come."
      }
    },
    {
      "start_date": {
        "year": 1996
      },
      "text": {
        "headline": "Appoints Triten Norbutse Council and Formalises Monastery Structure",
        "text": "In 1996, Rinpoche took a significant step in the institutional development of Triten Norbutse Monastery by appointing its first official council. The council was entrusted with overseeing the daily operations, education, discipline, and monastic life of the growing community. Rinpoche personally guided the drafting of the monastery's internal structure, roles, and governance functions, ensuring that Triten Norbutse would have a stable, transparent, and sustainable foundation rooted in the principles of Yungdrung Bön. This administrative framework allowed the monastery to expand its programmes, manage resources effectively, and uphold both scholastic and spiritual standards, providing a sense of reassurance about its future."
      }
    },
    {
      "start_date": {
        "year": 1997
      },
      "text": {
        "headline": "Leads Bön Mandala Project in Osaka, Japan",
        "text": "In 1997, Yongdzin Rinpoche led a landmark cultural preservation project in collaboration with the National Museum of Ethnology in Osaka, Japan. As the spiritual and academic supervisor, he oversaw the meticulous painting of 130 mandalas based on authoritative Bön ritual and meditation texts. The project aimed to document, preserve, and exhibit the rich visual heritage of the Bön tradition for both scholarly and public audiences. Rinpoche provided guidance on the iconographic accuracy of each mandala, ensured faithful representation of esoteric symbolism, and instructed the team on the corresponding ritual significance. He also advised on the writing and publication of the Mandalas of the Bön Religion. This comprehensive volume, which accompanied the exhibit, remains a vital resource for understanding the Bön religion's tantric arts. This initiative significantly raised international awareness of Bön's profound aesthetic and spiritual traditions."
      }
    },
    {
      "start_date": {
        "year": 1999
      },
      "text": {
        "headline": "Fourth Return to Tibet: Teachings, Ordinations, and Institutional Revitalisation",
        "text": "In 1999, His Eminence Yongdzin Rinpoche made his fourth return to Tibet, continuing his mission to revitalise the Bön tradition in its ancestral land. He reunited with Shen Norbu Wangyal once again and visited several important Bön monasteries in the Tengchen and Bachen regions. During this visit, Rinpoche consecrated sacred spaces, bestowed initiations and transmissions, and ordained new monks, providing essential support to local communities that have been working to restore Bön practices after decades of suppression. A major highlight of the trip was the inauguration of the dialectic school (shedra) at Tengchen Monastery, which revived advanced scholastic training in the region. Rinpoche also sponsored and initiated the establishment of a Tibetan medical school in Tengchen County, expanding his efforts beyond religion to include the preservation of traditional Tibetan healing knowledge. This journey reinforced his deep commitment to the spiritual, cultural, and educational rebirth of Bön in Tibet."
      }
    },
    {
      "start_date": {
        "year": 2001
      },
      "text": {
        "headline": "Bestowing First Geshe Degree at Triten Norbutse",
        "text": "Bestowing First Geshe Degree at Triten NorbutseTriten Norbutse Monastery"
      }
    },
    {
      "start_date": {
        "year": 2001
      },
      "text": {
        "headline": "Electing the abbot of Triten Norbutse",
        "text": "Appointed his disciple Jeru Geshe Tenpa Yungdrung as the abbot of Triten Norbutse Monastery"
      }
    },
    {
      "start_date": {
        "year": 2001
      },
      "text": {
        "headline": "Bestows Series of Secret Empowerments ",
        "text": "Bestows Series of Secret Empowerments to lay and monastic community at Triten Norbutse monastery"
      }
    },
    {
      "start_date": {
        "year": 2005
      },
      "text": {
        "headline": "Founds Shenten Dargye Ling Retreat Centre",
        "text": "Established French retreat centre; Bön recognised in France"
      }
    },
    {
      "start_date": {
        "year": 2005
      },
      "text": {
        "headline": "Publishes 13-Volume Collected Works",
        "text": "Publication in India"
      }
    },
    {
      "start_date": {
        "year": 2006
      },
      "text": {
        "headline": "French Government Recognises Shenten Dargye Ling",
        "text": "By the Ministry of the Interior of the French government"
      }
    },
    {
      "start_date": {
        "year": 2006
      },
      "text": {
        "headline": "Relocates Tibetan Medical School to Triten Norbutse",
        "text": "Relocating the Tibet Medical School from Dhorpatan to Triten Norbutse"
      }
    },
    {
      "start_date": {
        "year": 2007
      },
      "text": {
        "headline": "Final Return to Tibet and Ordains 150 Monks",
        "text": "Meeting Shen Norbu Wangyal, Gyalse yungrung Gyalwa, giving teachings and transmissions of the primary practice to the family members of Shen and meeting devotees from various parts of Tibet, ordaining more than 150 monks, identifying and visiting Bon sacred sites"
      }
    },
    {
      "start_date": {
        "year": 2007
      },
      "text": {
        "headline": "Visits Zhu Rizhing and Blesses New Sites",
        "text": "Visiting Zhu Rizhing Yungdrung Kundragling, inaugurating the meditation school there and visiting the newly purchased site for the future school of Sheing Phunthogling Bon Society in India, blessing and consecrating the site where the Tise Himalayan International School by Triten Norbutse would be located"
      }
    },
    {
      "start_date": {
        "year": 2009
      },
      "text": {
        "headline": "Oversees Stupa Construction at Shenten",
        "text": "Presiding over the stupa construction of the Yungdrung Loeg stupa"
      }
    },
    {
      "start_date": {
        "year": 2010
      },
      "text": {
        "headline": "Sends Relics Back to Menri in Tibet",
        "text": "Sending back two important images to the Menri monastery in Tibet"
      }
    },
    {
      "start_date": {
        "year": "2010"
      },
      "text": {
        "headline": "Completes Dzogchen Transmission to Western Lay Practitioners",
        "text": "Bestowing transmission and teachings of Zhang Zhung Nyengund Kagyud Korzhi completely to lay practitioners of the summer retreat of Shenten"
      }
    },
    {
      "start_date": {
        "year": 2017
      },
      "text": {
        "headline": "Guides 34th Abbot Election at Menri",
        "text": "Provides instructions for the 34th election of the Menri abbot"
      }
    },
    {
      "start_date": {
        "year": 2018
      },
      "text": {
        "headline": "Blesses 34th Abbot and Supports School Opening",
        "text": "Supporting the opening of the Tise Himalayan school, presiding over the Dutrisu ceremony in the autumn retreat of Shenten"
      }
    },
    {
      "start_date": {
        "year": 2019
      },
      "text": {
        "headline": "Begins Construction of New Temple at Triten Norbutse",
        "text": ""
      }
    },
    {
      "start_date": {
        "year": 2020
      },
      "text": {
        "headline": "Celebrates 95th Birthday with Devotees",
        "text": "Joined by Thousands of devotees from various countries of the East and West"
      }
    },
    {
      "start_date": {
        "year": 2021
      },
      "text": {
        "headline": "Publishes Complete 22-Volume Collected Works ",
        "text": "Publishing the full 22. volume of his works and the second edition of the 13 volumes of the previous works"
      }
    },
    {
      "start_date": {
        "year": 2024
      },
      "text": {
        "headline": "Moves into New Residence at Completed Temple",
        "text": ""
      }
    },
    {
      "start_date": {
        "year": 2025
      },
      "text": {
        "headline": "Inaugurates New Temple During Centennial",
        "text": "During the 100th year ceremony"
      }
    },
    {
      "start_date": {
        "year": 2025
      },
      "text": {
        "headline": "100th Birthday Celebration",
        "text": "Centennial celebrated with 6000 devotees"
      }
    },
    {
      "start_date": {
        "year": "2025"
      },
      "text": {
        "headline": "Enters Thukdam and Parinirvana",
        "text": "Passed away peacefully on June 12 during Saga Dawa"
      }
    }
  ]
}
