{
  "title": {
    "media": {
      "url": "",
      "caption": "The Life of H.E. Yongdzin Rinpoche",
      "credit": ""
    },
    "text": {
      "headline": "100 Years of Wisdom: The Life of H.E. Yongdzin Rinpoche",
      "text": "<p>An interactive journey through the spiritual legacy of H.E. Yongdzin Lopön Tenzin Namdak Rinpoche (1926–2025).</p>"
    }
  },
  "events": [
    {
      "start_date": {
        "year": "1926"
      },
      "text": {
        "headline": "Welcome to This Interactive Timeline",
        "text": "<p><strong>Honoring the Life and Legacy of H.E. Yongdzin Lopön Tenzin Namdak Rinpoche (1926–2025)</strong></p><p>This interactive timeline invites you to explore the extraordinary life, teachings, and spiritual legacy of His Eminence Yongdzin Lopön Tenzin Namdak Rinpoche — the foremost living master of the Yungdrung Bön tradition until his parinirvana in 2025.</p><p>Spanning nearly a century, this timeline traces key events from his birth in <em>Khanyin Village, Khyungpo, in the Kham region of eastern Tibet</em>, to his profound scholarly and spiritual contributions, and his global impact as a teacher, lineage holder, and founder of vital Bön institutions in exile.</p><p>You will discover major milestones, including:</p><ul><li>His early artistic training in tangka and mural painting,</li><li>Ordination and studies in Menri and Yungdrung Ling monasteries,</li><li>His retreat years, escape from Tibet, and spiritual leadership in exile,</li><li>The founding of <strong>Triten Norbutse Monastery</strong> in Nepal and <strong>Shenten Dargye Ling</strong> in France,</li><li>And his transmissions of Dzogchen and Bön teachings to thousands of students across East and West.</li></ul><h4>🕰️ Note on Dates</h4><p>While the <strong>year</strong> of each event is known and carefully documented, <strong>exact months and days are not always available</strong>. In such cases, only the year is shown. Where full date formatting was required for technical reasons, placeholder dates (e.g., January 1st) were used. These are not meant to represent the actual date of the event.</p><p>This timeline was created as a humble offering to honor the life of a master who lived in complete dedication to the preservation of the Bön tradition and the benefit of all sentient beings. May it serve as a source of inspiration, devotion, and remembrance for generations to come.</p>"
      },
      "media": {
        "url": "https://example.com/opening-image.jpg",
        "caption": "100 Years of Wisdom",
        "credit": "Triten Norbutse Archives"
      }
    }
  ]
}